app/controllers/welcome_controller.rb

SELECT  "dannis".* FROM "dannis" WHERE "dannis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "dannis" WHERE "dannis"."id" = $1  [["id", 1]]
---
	def read
		uid = params[:id]
		a = Danni.find(uid.to_i)
		b = a.send(:text)
		render plain: b
		Danni.destroy(uid.to_i)

INSERT INTO "dannis" ("id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 1], ["text", "da"], ["created_at", "2017-10-29 21:50:27.142490"], ["updated_at", "2017-10-29 21:50:27.142490"]]
---
	def put
		text = params[:text]
		num = getid()
		Danni.create(:id => num.to_i, :text => text)